
<template>
    <div>
        <img src="../assets/images/background-small.png" class="img-responsive" alt="Responsive image">   <!-- 主背景 -->
    
        <div class="container padding-t">
          <div class="row">
            <div class="col-md-12">
              <p class="titleLeft">我是标题的标题的标题</p>
              <p class="margin-p-t aboutContent">月光如洗，如流水般涌动;流水如镜，如月光般静谧。岸柳依依，探出细腰，欲与水中月比美;穿梭千年的小舟从月里推波而来，荡开一圈圈涟漪。古韵厚重的石拱桥，他的目光如水，皎洁月色为衣，夜风为乐。小楼高处，我的目光如水，他化为淡淡水墨画。
              月光如洗，如流水般涌动;流水如镜，如月光般静谧。岸柳依依，探出细腰，欲与水中月比美;穿梭千年的小舟从月里推波而来，荡开一圈圈涟漪。古韵厚重的石拱桥，他的目光如水，皎洁月色为衣，夜风为乐。小楼高处，我的目光如水，他化为淡淡水墨画。
              月光如洗，如流水般涌动;流水如镜，如月光般静谧。岸柳依依，探出细腰，欲与水中月比美;穿梭千年的小舟从月里推波而来，荡开一圈圈涟漪。古韵厚重的石拱桥，他的目光如水，皎洁月色为衣，夜风为乐。小楼高处，我的目光如水，他化为淡淡水墨画。
              月光如洗，如流水般涌动;流水如镜，如月光般静谧。岸柳依依，探出细腰，欲与水中月比美;穿梭千年的小舟从月里推波而来，荡开一圈圈涟漪。古韵厚重的石拱桥，他的目光如水，皎洁月色为衣，夜风为乐。小楼高处，我的目光如水，他化为淡淡水墨画。
              月光如洗，如流水般涌动;流水如镜，如月光般静谧。岸柳依依，探出细腰，欲与水中月比美;穿梭千年的小舟从月里推波而来，荡开一圈圈涟漪。古韵厚重的石拱桥，他的目光如水，皎洁月色为衣，夜风为乐。小楼高处，我的目光如水，他化为淡淡水墨画。
              月光如洗，如流水般涌动;流水如镜，如月光般静谧。岸柳依依，探出细腰，欲与水中月比美;穿梭千年的小舟从月里推波而来，荡开一圈圈涟漪。古韵厚重的石拱桥，他的目光如水，皎洁月色为衣，夜风为乐。小楼高处，我的目光如水，他化为淡，他化为淡淡水墨画。
              月光如洗，如流水般涌动;流水如镜，如月光般静谧。岸柳依依，探出细腰，欲与水中月比美;穿梭千年的小舟从月里推波而来，荡开一圈圈涟漪。古韵厚重的石拱桥，他的目光如水，皎洁月色为衣，夜风为乐。小楼高处，我的目光如水，他化为淡淡水墨画。
              月光如洗，如流水般涌动;流水如镜，如月光般静谧。岸柳依依，探出细腰，欲与水中月比美;穿梭千年的小舟从月里推波而来，荡开一圈圈涟漪。古韵厚重的石拱桥，他的目光如水，皎洁月色为衣，夜风为乐。小楼高处，我的目光如水，他化为淡淡水墨画。
              月光如洗，如流水般涌动;流水如镜，如月光般静谧。岸柳依依，探出细腰，欲与水中月比美;穿梭千年的小舟从月里推波而来，荡开一圈圈涟漪。古韵厚重的石拱桥，他的目光如水，皎洁月色为衣，夜风为乐。小楼高处，我的目光如水，他化为淡，他化为淡淡水墨画。
              月光如洗，如流水般涌动;流水如镜，如月光般静谧。岸柳依依，探出细腰，欲与水中月比美;穿梭千年的小舟从月里推波而来，荡开一圈圈涟漪。古韵厚重的石拱桥，他的目光如水，皎洁月色为衣，夜风为乐。小楼高处，我的目光如水，他化为淡淡水墨画。
              月光如洗，如流水般涌动;流水如镜，如月光般静谧。岸柳依依，探出细腰，欲与水中月比美;穿梭千年的小舟从月里推波而来，荡开一圈圈涟漪。古韵厚重的石拱桥，他的目光如水，皎洁月色为衣，夜风为乐。小楼高处，我的目光如水，他化为淡淡水墨画。
              月光如洗，如流水般涌动;流水如镜，如月光般静谧。岸柳依依，探出细腰，欲与水中月比美;穿梭千年的小舟从月里推波而来，荡开一圈圈涟漪。古韵厚重的石拱桥，他的目光如水，皎洁月色为衣，夜风为乐。小楼高处，我的目光如水，他化为淡淡水墨画。
              月光如洗，如流水般涌动;流水如镜，如月光般静谧。岸柳依依，探出细腰，欲与水中月比美;穿梭千年的小舟从月里推波而来，荡开一圈圈涟漪。古韵厚重的石拱桥，他的目光如水，皎洁月色为衣，夜风为乐。小楼高处，我的目光如水，他化为淡淡水墨画。</p>
            </div>
            <!-- <sideNav></sideNav> -->
          </div>
        </div>
    </div>
</template>

<script>

import Vue from 'vue'
import indexSideNav from '@/components/indexSideNav'

Vue.component('sideNav', indexSideNav);

export default {
  name: 'indexAbout',
  data () {
    return {
      msg: 'Welcome to Your Vue.js App'
    }
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
  .aboutContent{
    color: #9c9999;
    margin-top: 20px;
  }
  .padding-t{
    padding-top: 60px;
  }

  .titleLeft{
      text-align: center;
      padding: 10px 0;
      font-size: 20px;
      border-bottom: 1px solid #4d4b4b;
      font-weight: bold;
      letter-spacing: 0.5px;
      color: #ccc;
    }
</style>
